Revit 2027 API
BuiltInFailures.SketchFailures.CannotDrawExtrusionRoof Property
 Can't make extruded roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawExtrusionRoof { get; }
Public Shared ReadOnly Property CannotDrawExtrusionRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawExtrusionRoof {
	FailureDefinitionId^ get ();
}
static member CannotDrawExtrusionRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace